//-----------------------------------------------------------------------------
// File : asdxP4VHelper.
// Desc : Perforce Helix P4V Helper.
// Copyright(c) Project Asura. All right reserved. 
//-----------------------------------------------------------------------------
#pragma once


namespace asdx {

//-----------------------------------------------------------------------------
//! @brief      デフォルトのチェンジリストに対象ファイルを追加します.
//!
//! @param[in]      path        対象ファイルのパス.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool AddP4V(const char* path);

//-----------------------------------------------------------------------------
//! @brief      デフォルトのチェンジリストに対象ファイルをチェックアウトします.
//!
//! @param[in]      path        対象ファイルのパス.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool CheckoutP4V(const char* path);

//-----------------------------------------------------------------------------
//! @brief      対象ファイルの変更を元に戻します.
//!
//! @param[in]      path        対象ファイルのパス.
//! @return     プロセス起動の結果を返却します.
//-----------------------------------------------------------------------------
bool RevertP4V(const char* path);

} // namespace asdx
